src/cf/Catalogs/НастройкиТранспортаСообщенийОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиТранспортаСообщенийОбмена</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Корреспондент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПланыОбменаБСД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТранспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Настройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/УдалитьНастройкиТранспортаОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УдалитьНастройкиТранспортаОбменаДанными</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>COMАутентификацияОперационнойСистемы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMВариантРаботыИнформационнойБазы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMИмяИнформационнойБазыНаСервере1СПредприятия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMИмяСервера1СПредприятия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMКаталогИнформационнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMAILМаксимальныйДопустимыйРазмерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMAILСжиматьФайлИсходящегоСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMAILУчетнаяЗапись</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбменДаннымиУчетныеЗаписиЭлектроннойПочты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMAILТранслитерироватьИменаФайловСообщенийОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FILEКаталогОбменаИнформацией</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FILEСжиматьФайлИсходящегоСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FILEТранслитерироватьИменаФайловСообщенийОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPСжиматьФайлИсходящегоСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPСоединениеМаксимальныйДопустимыйРазмерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPСоединениеПассивноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPСоединениеПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPСоединениеПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPСоединениеПуть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPТранслитерироватьИменаФайловСообщенийОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSURLВебСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSЗапомнитьПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>165</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSИспользоватьПередачуБольшогоОбъемаДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSОбластьДанныхКорреспондента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидТранспортаСообщенийОбменаПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаСообщенийОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЭлементовВТранзакцииВыгрузкиДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЭлементовВТранзакцииЗагрузкиДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрыПодключенияВнешнейСистемы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSКонечнаяТочкаКорреспондента</Name>
					<Comment>Используется только в сервисе и только при автоматической настройки через внутреннюю публикацию</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонечнаяТочкаОбменаСообщениями</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Корреспондент</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиТранспортаОбменаОбластиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>НастройкиТранспортаОбменаОбластиДанных</Name>
			<Comment>Хранит частные настройки транспорта сообщений обмена для каждой области данных.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КонечнаяТочкаКорреспондента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонечнаяТочкаОбменаСообщениями</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогОбменаИнформацией</Name>
					<Comment>Относительный путь к каталогу обмена на сервере или в локальной сети.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Корреспондент</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыТранспортаСообщенийОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>ВидыТранспортаСообщенийОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>EMAIL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FILE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>COM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WSПассивныйРежим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяСистема</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/СценарииОбменовДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СценарииОбменовДанными</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗаданиеGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключенАвтоматически</Name>
					<Comment>Отключен из-за часто повторяющейся ошибке при выполнении обмена</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УзелИнформационнойБазы</Name>
							<Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВидТранспортаОбмена</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТранспортаСообщенийОбмена</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполняемоеДействие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияПриОбмене</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторТранспорта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/НастройкиТранспортаСообщенийОбмена/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьНастройки(СтруктураНастроек) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиТранспортаСообщенийОбмена");
		ЭлементБлокировки.УстановитьЗначение("Корреспондент", СтруктураНастроек.Корреспондент);
		ЭлементБлокировки.УстановитьЗначение("ИдентификаторТранспорта", СтруктураНастроек.ИдентификаторТранспорта);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	НастройкиТранспорта.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.НастройкиТранспортаСообщенийОбмена КАК НастройкиТранспорта
			|ГДЕ
			|	НастройкиТранспорта.Корреспондент = &Корреспондент
			|	И НастройкиТранспорта.ИдентификаторТранспорта = &ИдентификаторТранспорта";
			
		Запрос.УстановитьПараметр("Корреспондент", СтруктураНастроек.Корреспондент);
		Запрос.УстановитьПараметр("ИдентификаторТранспорта", СтруктураНастроек.ИдентификаторТранспорта);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Объект = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			Объект = Справочники.НастройкиТранспортаСообщенийОбмена.СоздатьЭлемент();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Объект, СтруктураНастроек, , "Настройки");
		
		Объект.Настройки.Очистить();
		
		Для Каждого КлючИЗначение Из СтруктураНастроек.Настройки Цикл
			
			НоваяСтрока = Объект.Настройки.Добавить();
			НоваяСтрока.Настройка = КлючИЗначение.Ключ;
			НоваяСтрока.Значение = КлючИЗначение.Значение;
			
		КонецЦикла;
		
		Объект.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
	
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьВсеНастройки(Корреспондент) Экспорт

	ТипКорреспондента = ТипЗнч(Корреспондент);
	Если НЕ Метаданные.ОпределяемыеТипы.ПланыОбменаБСД.Тип.СодержитТип(ТипКорреспондента) Тогда
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиТранспортаСообщенийОбмена");
		ЭлементБлокировки.УстановитьЗначение("Корреспондент", Корреспондент);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	НастройкиТранспорта.Ссылка КАК Ссылка,
			|	НастройкиТранспорта.ИдентификаторТранспорта КАК ИдентификаторТранспорта,
			|	НастройкиТранспорта.Настройки.(
			|		Настройка КАК Настройка,
			|		Значение КАК Значение
			|	) КАК Настройки
			|ИЗ
			|	Справочник.НастройкиТранспортаСообщенийОбмена КАК НастройкиТранспорта
			|ГДЕ
			|	НастройкиТранспорта.Корреспондент = &Корреспондент";
			
		Запрос.УстановитьПараметр("Корреспондент", Корреспондент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			РеквизитыДляБезопасногоХранилища = ТранспортСообщенийОбмена.ПараметрТранспорта(
				Выборка.ИдентификаторТранспорта, "РеквизитыДляБезопасногоХранилища");
				
			Если РеквизитыДляБезопасногоХранилища.Количество() > 0 Тогда
				
				ВыборкаПоНастройкам = Выборка.Настройки.Выбрать();
				
				Пока ВыборкаПоНастройкам.Следующий() Цикл
					
					Если РеквизитыДляБезопасногоХранилища.Найти(ВыборкаПоНастройкам.Настройка) <> Неопределено 
						И ЗначениеЗаполнено(ВыборкаПоНастройкам.Значение) Тогда
						ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(ВыборкаПоНастройкам.Значение);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
				
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.Удалить();
		
		КонецЦикла;
	
		ЗафиксироватьТранзакцию();
	
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
	
	КонецПопытки;
		
КонецПроцедуры

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам
Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт
	
	Выборка = СохраненныеНастройкиТранспорта();
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыЗапроса = ПараметрыЗапросаНаИспользованиеВнешнихРесурсов();
		ЗапросНаИспользованиеВнешнихРесурсов(ЗапросыРазрешений, Выборка, ПараметрыЗапроса);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТранспортПоУмолчанию(Корреспондент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Возвращаемое значение функции.
	ИдентификаторТранспорта = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиТранспорта.ИдентификаторТранспорта КАК ИдентификаторТранспорта
		|ИЗ
		|	Справочник.НастройкиТранспортаСообщенийОбмена КАК НастройкиТранспорта
		|ГДЕ
		|	НастройкиТранспорта.Корреспондент = &Корреспондент
		|	И НастройкиТранспорта.НастройкаПоУмолчанию";
	
	Запрос.УстановитьПараметр("Корреспондент", Корреспондент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ИдентификаторТранспорта = Выборка.ИдентификаторТранспорта;
	КонецЕсли;
	
	Возврат ИдентификаторТранспорта;
	
КонецФункции

Функция НастройкиТранспорта(Корреспондент, ИдентификаторТранспорта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Настройки.Настройка КАК Настройка,
		|	Настройки.Значение КАК Значение
		|ИЗ
		|	Справочник.НастройкиТранспортаСообщенийОбмена.Настройки КАК Настройки
		|ГДЕ
		|	Настройки.Ссылка.Корреспондент = &Корреспондент
		|	И Настройки.Ссылка.ИдентификаторТранспорта = &ИдентификаторТранспорта";
	
	Запрос.УстановитьПараметр("Корреспондент", Корреспондент);
	Запрос.УстановитьПараметр("ИдентификаторТранспорта", ИдентификаторТранспорта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НастройкиТранспорта = Новый Структура;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат НастройкиТранспорта;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НастройкиТранспорта.Вставить(Выборка.Настройка, Выборка.Значение);
	КонецЦикла;
		
	Возврат НастройкиТранспорта;
	
КонецФункции

Функция НастройкиТранспортаПоУмолчанию(Корреспондент, ИдентификаторТранспорта = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиТранспорта.ИдентификаторТранспорта КАК ИдентификаторТранспорта,
		|	НастройкиТранспорта.Настройки.(
		|		Настройка КАК Настройка,
		|		Значение КАК Значение
		|	) КАК Настройки
		|ИЗ
		|	Справочник.НастройкиТранспортаСообщенийОбмена КАК НастройкиТранспорта
		|ГДЕ
		|	НастройкиТранспорта.Корреспондент = &Корреспондент
		|	И НастройкиТранспорта.НастройкаПоУмолчанию";
	
	Запрос.УстановитьПараметр("Корреспондент", Корреспондент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НастройкиТранспорта = Новый Структура;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИдентификаторТранспорта = Выборка.ИдентификаторТранспорта;
		
		ВыборкаПоНастройкам = Выборка.Настройки.Выбрать();
		
		Пока ВыборкаПоНастройкам.Следующий() Цикл
			НастройкиТранспорта.Вставить(ВыборкаПоНастройкам.Настройка, ВыборкаПоНастройкам.Значение);
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат НастройкиТранспорта;
	
КонецФункции

Функция НастроенныеТипыТранспорта(Корреспондент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиТранспорта.ИдентификаторТранспорта КАК ИдентификаторТранспорта
		|ИЗ
		|	Справочник.НастройкиТранспортаСообщенийОбмена КАК НастройкиТранспорта
		|ГДЕ
		|	НастройкиТранспорта.Корреспондент = &Корреспондент";
	
	Запрос.УстановитьПараметр("Корреспондент", Корреспондент);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура НазначитьТранспортПоУмолчанию(Корреспондент, ИдентификаторТранспорта) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиТранспортаСообщенийОбмена");
	ЭлементБлокировки.УстановитьЗначение("Корреспондент", Корреспондент);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	НастройкиТранспорта.Ссылка КАК Ссылка,
			|	НастройкиТранспорта.ИдентификаторТранспорта КАК ИдентификаторТранспорта,
			|	НастройкиТранспорта.ИдентификаторТранспорта = &ИдентификаторТранспорта КАК НастройкаПоУмолчанию
			|ИЗ
			|	Справочник.НастройкиТранспортаСообщенийОбмена КАК НастройкиТранспорта
			|ГДЕ
			|	НастройкиТранспорта.Корреспондент = &Корреспондент
			|	И НастройкиТранспорта.НастройкаПоУмолчанию <> (НастройкиТранспорта.ИдентификаторТранспорта = &ИдентификаторТранспорта)";
		
		Запрос.УстановитьПараметр("Корреспондент", Корреспондент);
		Запрос.УстановитьПараметр("ИдентификаторТранспорта", ИдентификаторТранспорта);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СправочникНастроек = Выборка.Ссылка.ПолучитьОбъект();
			СправочникНастроек.НастройкаПоУмолчанию = Выборка.НастройкаПоУмолчанию;
			СправочникНастроек.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
		
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию() Экспорт

	НачатьТранзакцию();
	
	Попытка
	
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("РегистрСведений.УдалитьНастройкиТранспортаОбменаДанными");
		
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбменДаннымиВМоделиСервиса") Тогда
			
			Блокировка.Добавить("РегистрСведений.НастройкиТранспортаОбменаОбластиДанных");
			
		КонецЕсли;
		
		Блокировка.Добавить("Справочник.СценарииОбменовДанными");
		Блокировка.Добавить("Справочник.НастройкиТранспортаСообщенийОбмена");
		Блокировка.Заблокировать();
		
		ПеренестиНастройкиТранспорта();
		
		Если ОбщегоНазначения.РазделениеВключено()
			И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
			
			ПеренестиНастройкиТранспортаМенеджераСервсиа();
			
		КонецЕсли;
		
		ПеренестиНастройкиТранспортаСценариевОбмена();
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
	
	КонецПопытки;
	
КонецПроцедуры

Процедура ПеренестиНастройкиТранспорта()
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("Справочник.НастройкиТранспортаСообщенийОбмена");
		Блокировка.Заблокировать();
	
		Набор = РегистрыСведений.УдалитьНастройкиТранспортаОбменаДанными.СоздатьНаборЗаписей();
		Набор.Прочитать();
	
		Для Каждого Запись Из Набор Цикл
			
			Если НЕ ЗначениеЗаполнено(Запись.Корреспондент)
				ИЛИ Запись.Корреспондент.ПолучитьОбъект() = Неопределено Тогда
				
				// Пропускаем настройки с пустой или "битой" ссылкой (защита от ошибки в данных)
				Продолжить;
				
			КонецЕсли;
			
			ПеренестиНастройкиТранспортаДляЗаписи(Запись)
			
		КонецЦикла;
		
		Набор.Очистить();
		Набор.Записать();
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ПеренестиНастройкиТранспортаДляЗаписи(Запись)
	
	Пароли = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Запись.Корреспондент,
		"COMПарольПользователя, FTPСоединениеПароль, WSПароль, ПарольАрхиваСообщенияОбмена");
	
	НастроенныеВидыТранспорта = НастроенныеВидыТранспорта(Запись);
	
	Для Каждого ВидТранспорта Из НастроенныеВидыТранспорта Цикл
		
		НовыйСправочник = Справочники.НастройкиТранспортаСообщенийОбмена.СоздатьЭлемент();
		НовыйСправочник.Корреспондент = Запись.Корреспондент;
		НовыйСправочник.НастройкаПоУмолчанию = (Запись.ВидТранспортаСообщенийОбменаПоУмолчанию = ВидТранспорта);
		НовыйСправочник.ИдентификаторТранспорта = ОбщегоНазначения.ИмяЗначенияПеречисления(ВидТранспорта);
		Настройки = НовыйСправочник.Настройки;
	
		Если ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.EMAIL Тогда
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "МаксимальныйДопустимыйРазмерСообщения";
			НоваяСтрока.Значение = Запись.EMAILМаксимальныйДопустимыйРазмерСообщения;
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "СжиматьФайлИсходящегоСообщения";
			НоваяСтрока.Значение = Запись.EMAILСжиматьФайлИсходящегоСообщения;
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "УчетнаяЗапись";
			НоваяСтрока.Значение = Запись.EMAILУчетнаяЗапись;
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "Транслитерация";
			НоваяСтрока.Значение = Запись.EMAILТранслитерироватьИменаФайловСообщенийОбмена;
			
			Если ЗначениеЗаполнено(Пароли.ПарольАрхиваСообщенияОбмена) Тогда
				ПарольАрхиваСообщенияОбмена = Строка(Новый УникальныйИдентификатор);
				ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ПарольАрхиваСообщенияОбмена, Пароли.ПарольАрхиваСообщенияОбмена);
				
				НоваяСтрока = НовыйСправочник.Настройки.Добавить();
				НоваяСтрока.Настройка = "ПарольАрхиваСообщенияОбмена";
				НоваяСтрока.Значение = ПарольАрхиваСообщенияОбмена;
			КонецЕсли;
	
		ИначеЕсли ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.FILE Тогда
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "КаталогОбменаИнформацией";
			НоваяСтрока.Значение = Запись.FILEКаталогОбменаИнформацией;
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "СжиматьФайлИсходящегоСообщения";
			НоваяСтрока.Значение = Запись.FILEСжиматьФайлИсходящегоСообщения;
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "Транслитерация";
			НоваяСтрока.Значение = Запись.FILEТранслитерироватьИменаФайловСообщенийОбмена;
			
			Если ЗначениеЗаполнено(Пароли.ПарольАрхиваСообщенияОбмена) Тогда
				ПарольАрхиваСообщенияОбмена = Строка(Новый УникальныйИдентификатор);
				ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ПарольАрхиваСообщенияОбмена, Пароли.ПарольАрхиваСообщенияОбмена);
				
				НоваяСтрока = НовыйСправочник.Настройки.Добавить();
				НоваяСтрока.Настройка = "ПарольАрхиваСообщенияОбмена";
				НоваяСтрока.Значение = ПарольАрхиваСообщенияОбмена;
			КонецЕсли;
			
		ИначеЕсли ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.FTP Тогда
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "МаксимальныйДопустимыйРазмерСообщения";
			НоваяСтрока.Значение = Запись.FTPСоединениеМаксимальныйДопустимыйРазмерСообщения;
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "ПассивноеСоединение";
			НоваяСтрока.Значение = Запись.FTPСоединениеПассивноеСоединение;
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "Пользователь";
			НоваяСтрока.Значение = Запись.FTPСоединениеПользователь;
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "Порт";
			НоваяСтрока.Значение = Запись.FTPСоединениеПорт;
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "Путь";
			НоваяСтрока.Значение = Запись.FTPСоединениеПуть;
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "СжиматьФайлИсходящегоСообщения";
			НоваяСтрока.Значение = Запись.FTPСжиматьФайлИсходящегоСообщения;
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "Транслитерация";
			НоваяСтрока.Значение = Запись.FTPТранслитерироватьИменаФайловСообщенийОбмена;
			
			Если ЗначениеЗаполнено(Пароли.ПарольАрхиваСообщенияОбмена) Тогда
				ПарольАрхиваСообщенияОбмена = Строка(Новый УникальныйИдентификатор);
				ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ПарольАрхиваСообщенияОбмена, Пароли.ПарольАрхиваСообщенияОбмена);
				
				НоваяСтрока = НовыйСправочник.Настройки.Добавить();
				НоваяСтрока.Настройка = "ПарольАрхиваСообщенияОбмена";
				НоваяСтрока.Значение = ПарольАрхиваСообщенияОбмена;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Пароли.FTPСоединениеПароль) Тогда
				Пароль = Строка(Новый УникальныйИдентификатор);
				ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Пароль, Пароли.FTPСоединениеПароль);
				
				НоваяСтрока = НовыйСправочник.Настройки.Добавить();
				НоваяСтрока.Настройка = "Пароль";
				НоваяСтрока.Значение = Пароль;
			КонецЕсли;
			
		ИначеЕсли ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.WS Тогда
			
			Если ЗначениеЗаполнено(Запись.WSКонечнаяТочкаКорреспондента) Тогда
				
				НовыйСправочник.ИдентификаторТранспорта = "SM";
				
				НоваяСтрока = НовыйСправочник.Настройки.Добавить();
				НоваяСтрока.Настройка = "ВнутренняяПубликация";
				НоваяСтрока.Значение = Истина;
				
				НоваяСтрока = НовыйСправочник.Настройки.Добавить();
				НоваяСтрока.Настройка = "КонечнаяТочкаКорреспондента";
				НоваяСтрока.Значение = Запись.WSКонечнаяТочкаКорреспондента;
				
				НоваяСтрока = НовыйСправочник.Настройки.Добавить();
				НоваяСтрока.Настройка = "ОбластьДанныхКорреспондента";
				НоваяСтрока.Значение = Запись.WSОбластьДанныхКорреспондента;
				
			Иначе
				
				НоваяСтрока = НовыйСправочник.Настройки.Добавить();
				НоваяСтрока.Настройка = "АдресВебСервиса";
				НоваяСтрока.Значение = Запись.WSURLВебСервиса;
				
				НоваяСтрока = НовыйСправочник.Настройки.Добавить();
				НоваяСтрока.Настройка = "ИмяПользователя";
				НоваяСтрока.Значение = Запись.WSИмяПользователя;
				
				НоваяСтрока = НовыйСправочник.Настройки.Добавить();
				НоваяСтрока.Настройка = "ЗапомнитьПароль";
				НоваяСтрока.Значение = Запись.WSЗапомнитьПароль;
					
				Если Запись.WSЗапомнитьПароль И ЗначениеЗаполнено(Пароли.WSПароль) Тогда
				
					Пароль = Строка(Новый УникальныйИдентификатор);
					ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Пароль, Пароли.WSПароль);
					
					НоваяСтрока = НовыйСправочник.Настройки.Добавить();
					НоваяСтрока.Настройка = "Пароль";
					НоваяСтрока.Значение = Пароль;
					
				КонецЕсли;
			
			КонецЕсли;
			
		ИначеЕсли ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.COM Тогда
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "ВариантРаботыИнформационнойБазы";
			НоваяСтрока.Значение = Запись.COMВариантРаботыИнформационнойБазы;
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "КаталогИнформационнойБазы";
			НоваяСтрока.Значение = Запись.COMКаталогИнформационнойБазы;
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "АутентификацияОперационнойСистемы";
			НоваяСтрока.Значение = Запись.COMАутентификацияОперационнойСистемы;
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "ИмяПользователя";
			НоваяСтрока.Значение = Запись.COMИмяПользователя;
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "ИмяСервера1СПредприятия";
			НоваяСтрока.Значение = Запись.COMИмяСервера1СПредприятия;
			
			НоваяСтрока = НовыйСправочник.Настройки.Добавить();
			НоваяСтрока.Настройка = "ИмяИнформационнойБазыНаСервере1СПредприятия";
			НоваяСтрока.Значение = Запись.COMИмяИнформационнойБазыНаСервере1СПредприятия;
			
			Если ЗначениеЗаполнено(Пароли.COMПарольПользователя) Тогда
				ПарольПользователя = Строка(Новый УникальныйИдентификатор);
				ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ПарольПользователя, Пароли.COMПарольПользователя);
				
				НоваяСтрока = НовыйСправочник.Настройки.Добавить();
				НоваяСтрока.Настройка = "ПарольПользователя";
				НоваяСтрока.Значение = ПарольПользователя;
			КонецЕсли;
			
		ИначеЕсли ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.WSПассивныйРежим Тогда
			
			НовыйСправочник.ИдентификаторТранспорта = "ПассивныйРежим";
			
		КонецЕсли;
		
		НовыйСправочник.Записать();
		
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(Запись.Корреспондент, "");
			
КонецПроцедуры

Функция НастроенныеВидыТранспорта(Запись)
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(Запись.COMКаталогИнформационнойБазы) 
		Или ЗначениеЗаполнено(Запись.COMИмяИнформационнойБазыНаСервере1СПредприятия) Тогда
		Результат.Добавить(Перечисления.ВидыТранспортаСообщенийОбмена.COM);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.EMAILУчетнаяЗапись) Тогда
		Результат.Добавить(Перечисления.ВидыТранспортаСообщенийОбмена.EMAIL);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.FILEКаталогОбменаИнформацией) Тогда
		Результат.Добавить(Перечисления.ВидыТранспортаСообщенийОбмена.FILE);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.FTPСоединениеПуть) Тогда
		Результат.Добавить(Перечисления.ВидыТранспортаСообщенийОбмена.FTP);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.WSURLВебСервиса)
		Или ЗначениеЗаполнено(Запись.WSКонечнаяТочкаКорреспондента) Тогда
		Результат.Добавить(Перечисления.ВидыТранспортаСообщенийОбмена.WS);
	КонецЕсли;
	
	Если Запись.ВидТранспортаСообщенийОбменаПоУмолчанию = Перечисления.ВидыТранспортаСообщенийОбмена.WSПассивныйРежим Тогда
		Результат.Добавить(Перечисления.ВидыТранспортаСообщенийОбмена.WSПассивныйРежим);  
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПеренестиНастройкиТранспортаМенеджераСервсиа()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиТранспортаОбменаОбластиДанных.Корреспондент КАК Корреспондент,
		|	НастройкиТранспортаОбменаОбластиДанных.КонечнаяТочкаКорреспондента КАК КонечнаяТочкаКорреспондента,
		|	НастройкиТранспортаСообщенийОбмена.ИдентификаторТранспорта КАК ИдентификаторТранспорта
		|ИЗ
		|	РегистрСведений.НастройкиТранспортаОбменаОбластиДанных КАК НастройкиТранспортаОбменаОбластиДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиТранспортаСообщенийОбмена КАК НастройкиТранспортаСообщенийОбмена
		|		ПО НастройкиТранспортаОбменаОбластиДанных.Корреспондент = НастройкиТранспортаСообщенийОбмена.Корреспондент
		|			И (НастройкиТранспортаСообщенийОбмена.ИдентификаторТранспорта = ""SM"")
		|ГДЕ
		|	НастройкиТранспортаСообщенийОбмена.Корреспондент ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовыйСправочник = Справочники.НастройкиТранспортаСообщенийОбмена.СоздатьЭлемент();
		НовыйСправочник.Корреспондент = Выборка.Корреспондент;
		НовыйСправочник.ИдентификаторТранспорта = "SM";
		НовыйСправочник.НастройкаПоУмолчанию = Истина;
		
		НоваяСтрока = НовыйСправочник.Настройки.Добавить();
		НоваяСтрока.Настройка = "КонечнаяТочкаКорреспондента";
		НоваяСтрока.Значение = Выборка.КонечнаяТочкаКорреспондента;
		
		НоваяСтрока = НовыйСправочник.Настройки.Добавить();
		НоваяСтрока.Настройка = "НаименованиеКорреспондента";
		НоваяСтрока.Значение = Строка(Выборка.Корреспондент);
		
		НовыйСправочник.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПеренестиНастройкиТранспортаСценариевОбмена()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкиОбмена.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СценарииОбменовДанными.НастройкиОбмена КАК НастройкиОбмена
		|ГДЕ
		|	(ВЫРАЗИТЬ(НастройкиОбмена.ИдентификаторТранспорта КАК СТРОКА(100))) = """"";

	НачатьТранзакцию();

	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.СценарииОбменовДанными");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
				
			Сценарий = Выборка.Ссылка.ПолучитьОбъект();
			
			Для Каждого Настройка Из Сценарий.НастройкиОбмена Цикл
				
				Если ЗначениеЗаполнено(Настройка.ИдентификаторТранспорта) Тогда
					Продолжить;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Настройка.УдалитьВидТранспортаОбмена) Тогда
					Продолжить; // Пропускаем строки с пустым транспортом
				КонецЕсли;
				
				Если ОбщегоНазначения.РазделениеВключено()
					И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
				
					Настройка.ИдентификаторТранспорта = "SM";
					
				Иначе
					
					ИдентификаторТранспорта = ОбщегоНазначения.ИмяЗначенияПеречисления(Настройка.УдалитьВидТранспортаОбмена);
					
					Если ИдентификаторТранспорта = "WSПассивныйРежим" Тогда 
						
						ИдентификаторТранспорта = "ПассивныйРежим";
						
					ИначеЕсли ИдентификаторТранспорта = "ВнешняяСистема" Тогда
						
						ИдентификаторТранспорта = "";
						
					КонецЕсли;
					
					Настройка.ИдентификаторТранспорта = ИдентификаторТранспорта;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Сценарий.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Функция СохраненныеНастройкиТранспорта()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиТранспорта.ИдентификаторТранспорта КАК ИдентификаторТранспорта,
		|	НастройкиТранспорта.Корреспондент КАК Корреспондент,
		|	НастройкиТранспорта.Настройки.(
		|		Настройка КАК Настройка,
		|		Значение КАК Значение
		|	) КАК Настройки
		|ИЗ
		|	Справочник.НастройкиТранспортаСообщенийОбмена КАК НастройкиТранспорта";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ПараметрыЗапросаНаИспользованиеВнешнихРесурсов()
	
	Параметры = Новый Структура;
	Параметры.Вставить("ЗапрашиватьCOM",  Истина);
	Параметры.Вставить("ЗапрашиватьFILE", Истина);
	Параметры.Вставить("ЗапрашиватьWS",   Истина);
	Параметры.Вставить("ЗапрашиватьFTP",  Истина);
	
	Возврат Параметры;
	
КонецФункции

Процедура ЗапросНаИспользованиеВнешнихРесурсов(ЗапросыРазрешений, Запись, ПараметрыЗапроса) Экспорт
	
	Разрешения = Новый Массив;
	
	МодульРаботаВБезопасномРежиме = ОбщегоНазначения.ОбщийМодуль("РаботаВБезопасномРежиме");
	
	ИдентификаторТранспорта = Запись.ИдентификаторТранспорта;
	Корреспондент = Запись.Корреспондент;
	
	НастройкиТранспорта = Новый Структура;
	ВыборкаПоНастройкам = Запись.Настройки.Выбрать();
	Пока ВыборкаПоНастройкам.Следующий() Цикл
		НастройкиТранспорта.Вставить(ВыборкаПоНастройкам.Настройка, ВыборкаПоНастройкам.Значение);
	КонецЦикла;
		
	Если Не ЗначениеЗаполнено(НастройкиТранспорта) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗапроса.ЗапрашиватьFTP 
		И ИдентификаторТранспорта = "FTP"
		И Не ПустаяСтрока(НастройкиТранспорта.Путь) Тогда
		
		СтруктураАдреса = ОбщегоНазначенияКлиентСервер.СтруктураURI(НастройкиТранспорта.Путь);
		Разрешения.Добавить(МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
			СтруктураАдреса.Схема, СтруктураАдреса.Хост, НастройкиТранспорта.Порт));
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.ЗапрашиватьFILE 
		И ИдентификаторТранспорта = "FILE"
		И Не ПустаяСтрока(НастройкиТранспорта.КаталогОбменаИнформацией) Тогда
		
		Разрешения.Добавить(МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеКаталогаФайловойСистемы(
			НастройкиТранспорта.КаталогОбменаИнформацией, Истина, Истина));
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.ЗапрашиватьWS 
		И (ИдентификаторТранспорта = "WS" Или ИдентификаторТранспорта = "HTTP")
		И Не ПустаяСтрока(НастройкиТранспорта.АдресВебСервиса) Тогда
		
		СтруктураАдреса = ОбщегоНазначенияКлиентСервер.СтруктураURI(НастройкиТранспорта.АдресВебСервиса);
		Если ЗначениеЗаполнено(СтруктураАдреса.Схема) Тогда
			Разрешения.Добавить(МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
				СтруктураАдреса.Схема, СтруктураАдреса.Хост, СтруктураАдреса.Порт));
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.ЗапрашиватьCOM 
		И ИдентификаторТранспорта = "COM"
		И (Не ПустаяСтрока(НастройкиТранспорта.КаталогИнформационнойБазы)
		Или Не ПустаяСтрока(НастройкиТранспорта.ИмяИнформационнойБазыНаСервере1СПредприятия)) Тогда
		
		ИмяCOMСоединителя = ОбщегоНазначенияКлиентСервер.ИмяCOMСоединителя();
		Разрешения.Добавить(МодульРаботаВБезопасномРежиме.РазрешениеНаСозданиеCOMКласса(
			ИмяCOMСоединителя, ОбщегоНазначения.ИдентификаторCOMСоединителя(ИмяCOMСоединителя)));
		
	КонецЕсли;
	
	// Разрешения для обмена через почту запрашиваются в подсистеме Работе с почтовыми сообщениями.
	
	Если Разрешения.Количество() > 0 Тогда
		
		ЗапросыРазрешений.Добавить(
			МодульРаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(Разрешения, Корреспондент));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
